test/artillery/artillery.yml
config:
  target: 'http://localhost:1337'
  processor: "./artillery.generate.data.js"
  phases:
  
    - duration: 30
      arrivalRate: 500

  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "S&B gets a video"
    flow:
      # - loop: 
      - function: "generateRandomIds"
      - get:
          url: "/videos/search/{{ videoId }}"
        # Print the data we're sending while debugging the script:
      - log: "Sent a request to {{ videoId }}"
        # count: 50