test/artillery/artillery.yml
config:
  target: 'http://localhost:1337'
  processor: "./artillery.generate.data.js"
  phases:
  
    # - duration: 30
    #   arrivalRate: 300
    # - duration: 10
    #   arrivalRate: 300
    #   rampTo: 600

    # - duration: 30
    #   arrivalRate: 600
    # - duration: 10
    #   arrivalRate: 600
    #   rampTo: 900

    # - duration: 30
    #   arrivalRate: 900
    # - duration: 10
    #   arrivalRate: 900
    #   rampTo: 1200

    # - duration: 30
    #   arrivalRate: 1200
    # - duration: 10
    #   arrivalRate: 1200
    #   rampTo: 1500

    - duration: 30
      arrivalRate: 10

  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "S&B gets a video"
    flow:
      - loop: 
        - function: "generateRandomIds"
        - get:
            url: "/videos/search/{{ videoId }}"
        # Print the data we're sending while debugging the script:
        - log: "Sent a request to {{ videoId }}"
        count: 50